import { Htag, Ptag } from "../../components";
import styles from "./Privacy.module.css";

export const Privacy = () => {
  return (
    <div className={styles.wrapper}>
      <Htag tag="h2" size="m" color="black">
        Политика конфиденциальности
      </Htag>
      <br />
      <Ptag color="black">
        Интернет-магазин «Мир Дерева Владимир» ценит доверие своих клиентов и
        заботится о сохранении их личных (персональных) данных в тайне от
        мошенников и третьих лиц. Эта Политика конфиденциальности разработана
        для того, чтобы данные, предоставленные клиентами, были в сохранности и
        защищались от доступа третьих лиц. Интернет-магазин собирает ваши личные
        (персональные) сведения исключительно для того, чтобы совершенствовать
        качество обслуживания и эффективность нашего взаимодействия.
      </Ptag>
      <br />
      <Htag tag="h3" size="s" color="black">
        1. Общие вопросы
      </Htag>
      <br />
      <Ptag color="black">
        1.1. Настоящая Политика конфиденциальности описывает методы
        использования и хранения интернет-магазином «Мир Дерева Владимир»
        конфиденциальной информации клиентов, посещающих сайт mdvlad.ru.
        <br />
        1.2. Предоставляя интернет-магазину «Мир Дерева Владимир» информацию
        частного характера через сайт mdvlad.ru, клиент свободно, своей волей
        дает согласие на передачу, использование и раскрытие его персональных
        данных согласно условиям настоящей Политики конфиденциальности.
        <br />
        1.3. Настоящая Политика конфиденциальности применяется только в
        отношении информации частного характера, полученной через данный сайт.
        Информация частного характера – это информация, позволяющая при ее
        использовании отдельно или в комбинации с другой доступной
        интернет-магазину информацией идентифицировать персональные данные
        клиента.
        <br />
        1.4. Сайт не содержит материалов, неприемлемых для детей и подростков
        младше 14 лет. Однако они не могут передавать никакие личные данные
        через интернет без согласия одного из родителей или опекуна.
        Интернет-магазин «Мир Дерева Владимир» гарантирует, что сознательно не
        собирает и не хранит никаких личных данных, связанных с
        несовершеннолетними лицами.
        <br />
        1.5. На сайте mdvlad.ru могут иметься ссылки, позволяющие перейти на
        другие сайты. Интернет-магазин не несет ответственности за сведения,
        публикуемые на этих сайтах, и предоставляет ссылки на них только в целях
        обеспечения удобства клиентов. На сайте mdvlad.ru не публикуются
        преднамеренно ссылки на интернет-ресурсы, которые могут привести к
        повреждению компьютера клиента или заражению его вирусами.
      </Ptag>
      <br />
      <Htag tag="h3" size="s" color="black">
        2. Данные, которые получает интернет-магазин
      </Htag>
      <br />
      <Ptag color="black">
        2.1. Если пользователь не зарегистрирован на сайте, просмотр содержимого
        на ресурсе – анонимный. Серверы сайта mdvlad.ru могут собирать для
        статистики информацию о типе браузера, компьютера и операционной
        системы, а также IP-адрес.
        <br />
        2.2. Какие данные зарегистрированных пользователей собираются и
        сохраняются?
        <br />
        2.2.1. Персональная информация, а также любая другая информация, которую
        клиенты сознательно и добровольно передают в процессе регистрации и
        использования сайта:
        <br />
        фамилия, имя, отчество;
        <br />
        e-mail;
        <br />
        мобильный телефон;
        <br />
        пароль – аналог собственноручной подписи.
        <br />
        Если заказ был отправлен ошибочно по причине с предоставления
        недостоверных данных, интернет-магазин «Мир Дерева Владимир» снимает с
        себя всякую ответственность за доставку такого заказа.
        <br />
        Аналогом собственноручной подписи клиента является пароль доступа к его
        учетной записи. Все действия, совершенные в системе с использованием
        аналога собственноручной подписи пользователя, признаются совершенными
        лично пользователем. Клиент несет полную ответственность за сохранность
        и неразглашение данных аналога собственноручной подписи.
        <br />
        С какой целью собирается: для регистрации пользователя на сайте,
        принятия, обработки и доставки заказа; осуществления обратной связи с
        клиентом, предоставления клиентской поддержки; оповещения об изменениях
        в работе наших служб; предоставления, с согласия клиента, предложений и
        информации об акциях, поступлениях новинок, рекламных рассылок.
        <br />
        Пользователь может изменять, обновлять или удалять свои персональные
        данные в Личном кабинете. Интернет-магазин вправе удалять любую
        информацию, содержащую личные данные пользователей сайта.
        <br />
        2.2.2. Данные из cookies-файлов. Это небольшие текстовые файлы, в
        которых после посещения нашего сайта сохраняется информация о действиях
        клиента на ресурсе. Эти файлы не влияют на операционную систему
        компьютера.
        <br />
        С какой целью собираются: благодаря cookies-файлам пользователю не нужно
        каждый раз вводить имя и пароль, чтобы зайти в Личный кабинет.
        Сохраняются все настройки, например индивидуальные предпочтения.
        Интернет-магазин использует эту информацию для ведения статистики о
        пользователях и их запросах. Эти исследования помогают интернет-магазину
        анализировать, оценивать, улучшать свою работу, повышать качество
        продуктов и услуг, совершенствовать механизмы общения с клиентами.
        <br />
        Клиент может удалить cookies-файлы после посещения сайта mdvlad.ru.
        Однако в этом случае интернет-магазин «Мир Дерева Владимир» не несет
        ответственности за ненадлежащее качество работы ресурса.
        <br />
        2.2.3. Информация от браузера – данные, которые браузер автоматически
        отправляет серверу, например: IP-адрес, историю последних посещений,
        название операционной системы, название и версию программы, через
        которую клиент осуществляет выход в интернет, дату и время посещения
        сайта пользователем. Можно запретить браузеру передавать подобную
        информацию путем изменения настроек.
        <br />С какой целью собирается: интернет-магазин ведет статистику
        посещений для функционирования своих серверов и учета собственного
        трафика. В данном случае собранная статистическая информация не
        ассоциируется с конкретными пользователями и обрабатывается только в
        виде обобщенной статистики. IP-адрес клиента и время доступа к системе,
        в соответствии с пользовательским идентификатором, сохраняются в базе
        данных в целях предотвращения мошенничества.
      </Ptag>
      <br />
      <Htag tag="h3" size="s" color="black">
        3. Охрана личной информации пользователей
      </Htag>
      <br />
      <Ptag color="black">
        3.1. Интернет-магазин «Мир Дерева Владимир» никогда и ни при каких
        обстоятельствах не сообщает третьим лицам личную (персональную)
        информацию о своих клиентах, кроме случаев, предписанных Федеральным
        законом от 27.07.2006 г. № 152-ФЗ «О персональных данных», или когда
        клиент добровольно соглашается на передачу информации.
        <br />
        3.2. Интернет-магазин имеет право использовать другие компании и частных
        лиц для выполнения определенных видов работ, например: доставка почты и
        сообщений по электронной почте, удаление дублированной информации из
        списков клиентов, анализ данных, предоставление маркетинговых услуг. Эти
        юридические/физические лица имеют доступ к личной информации
        пользователей, только когда это необходимо для выполнения их функций.
        Данная информация не может быть использована ими в других целях.
        <br />
        3.3. Интернет-магазин реализует мероприятия по защите личных
        (персональных) данных клиентов в следующих направлениях:
        <br />
        предотвращение утечки информации, содержащей личные (персональные)
        данные, по техническим каналам связи и иными способами;
        <br />
        предотвращение несанкционированного доступа к информации, содержащей
        личные (персональные) данные, специальных воздействий на такую
        информацию (носителей информации) в целях ее добывания, уничтожения,
        искажения и блокирования доступа к ней;
        <br />
        защита от вредоносных программ;
        <br />
        обнаружение вторжений и компьютерных атак.
      </Ptag>
      <br />
      <Htag tag="h3" size="s" color="black">
        4. Время хранения информации
      </Htag>
      <br />
      <Ptag color="black">
        Интернет-магазин хранит частную информацию клиентов ровно столько
        времени, сколько она остается необходимой для достижения тех целей, ради
        которых она была изначально получена, или других законных целей, за
        исключением случаев, когда более длительный период хранения информации
        необходим в соответствии с законодательством либо разрешен им.
      </Ptag>
      <br />
      <Htag tag="h3" size="s" color="black">
        5. Сотрудничество с государственными органами
      </Htag>
      <br />
      <Ptag color="black">
        Существуют ограниченные условия, при которых интернет-магазин «Мир
        Дерева Владимир» может предоставить информацию частного характера из
        своих баз данных сторонним третьим лицам:
        <br />
        в целях удовлетворения требований, запросов или распоряжения суда;
        <br />
        в целях сотрудничества с правоохранительными, следственными или другими
        государственными органами. При этом интернет-магазин оставляет за собой
        право сообщать в государственные органы о любой противоправной
        деятельности без уведомления пользователя об этом;
        <br />
        в целях предотвращения или расследования предполагаемого правонарушения,
        например, мошенничества или кражи идентификационных данных;
        <br />в целях защиты юридических прав, прав собственности или
        безопасности сайта, сотрудников интернет-магазина, агентов, других
        пользователей и общества в целом.
      </Ptag>
      <br />
      <Htag tag="h3" size="s" color="black">
        6. Внесение изменений и дополнений
      </Htag>
      <br />
      <Ptag color="black">
        Все изменения положений или условий политики использования личной
        информации будут отражены в этом документе. Интернет-магазин «Мир Дерева
        Владимир» оставляет за собой право вносить изменения в те или иные
        разделы данного документа в любое время без предварительного
        уведомления, разместив обновленную версию настоящей Политики
        конфиденциальности на сайте на этой странице. С момента ее опубликования
        пользователи подчиняются новым условиям Политики конфиденциальности.
      </Ptag>
      <br />
      <Htag tag="h3" size="s" color="black">
        7. Правила обработки персональных данных
      </Htag>
      <br />
      <Ptag color="black">
        Данные, которые Вы предоставляете, заполняя настоящую анкету, будут
        использованы ИП Береснев М.А (ИНН 531005114616, ОГРНИП 318332800019033)
        и ИП Жилин А.В. (ИНН 773273561156, ОГРНИП 321774600035712) при
        формировании базы данных о покупателях и для информирования Вас об
        акциях и специальных предложениях торгового комплекса «Мир Дерева». Для
        достижения указанных целей, данные могут быть подвергнуты обработке с
        применением средств автоматизации и вычислительной техники. Заполнение
        вами настоящей анкеты означает согласие на использование и обработку
        данных описанными способами и на получение информации об акциях по
        телефону (SMS) и электронной почте по указанному к анкете адресу.
        Настоящее согласие действует с даты заполнения Вами настоящей анкеты на
        весь срок участия в Программе лояльности или на весь срок действия
        Программы лояльности. Настоящее согласие может быть отозвано Вами в
        любой момент путем предоставления письменного заявления в свободной
        форме в любом из магазинов торгового комплекса «Мир Дерева». ИП Береснев
        М.А. и ИП Жилин А.В гарантируют использование предоставляемых Вами
        данных исключительно описанными способами, гарантируют
        конфиденциальность и нераспространение указанных данных.
      </Ptag>
    </div>
  );
};
